<a href="https://colab.research.google.com/github/YukiNoji3/SampleCode/blob/master/Python_DataAnalysis(pandas).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

4.2**.1** pandasの概要

In [0]:
import pandas as pd

In [160]:
ser = pd.Series([10, 20, 30, 40])
ser

0    10
1    20
2    30
3    40
dtype: int64

In [161]:
df = pd.DataFrame([[10, 'a', True],
                  [20, 'b', False],
                  [30, 'c', False],
                  [40, 'd', True]])
df

    0  1      2
0  10  a   True
1  20  b  False
2  30  c  False
3  40  d   True

In [0]:
import numpy as np
df = pd.DataFrame(np.arange(100).reshape((25, 4)))

In [163]:
df

     0   1   2   3
0    0   1   2   3
1    4   5   6   7
2    8   9  10  11
3   12  13  14  15
4   16  17  18  19
5   20  21  22  23
6   24  25  26  27
7   28  29  30  31
8   32  33  34  35
9   36  37  38  39
10  40  41  42  43
11  44  45  46  47
12  48  49  50  51
13  52  53  54  55
14  56  57  58  59
15  60  61  62  63
16  64  65  66  67
17  68  69  70  71
18  72  73  74  75
19  76  77  78  79
20  80  81  82  83
21  84  85  86  87
22  88  89  90  91
23  92  93  94  95
24  96  97  98  99

In [164]:
df.head

<bound method NDFrame.head of      0   1   2   3
0    0   1   2   3
1    4   5   6   7
2    8   9  10  11
3   12  13  14  15
4   16  17  18  19
5   20  21  22  23
6   24  25  26  27
7   28  29  30  31
8   32  33  34  35
9   36  37  38  39
10  40  41  42  43
11  44  45  46  47
12  48  49  50  51
13  52  53  54  55
14  56  57  58  59
15  60  61  62  63
16  64  65  66  67
17  68  69  70  71
18  72  73  74  75
19  76  77  78  79
20  80  81  82  83
21  84  85  86  87
22  88  89  90  91
23  92  93  94  95
24  96  97  98  99>

In [165]:
df.tail

<bound method NDFrame.tail of      0   1   2   3
0    0   1   2   3
1    4   5   6   7
2    8   9  10  11
3   12  13  14  15
4   16  17  18  19
5   20  21  22  23
6   24  25  26  27
7   28  29  30  31
8   32  33  34  35
9   36  37  38  39
10  40  41  42  43
11  44  45  46  47
12  48  49  50  51
13  52  53  54  55
14  56  57  58  59
15  60  61  62  63
16  64  65  66  67
17  68  69  70  71
18  72  73  74  75
19  76  77  78  79
20  80  81  82  83
21  84  85  86  87
22  88  89  90  91
23  92  93  94  95
24  96  97  98  99>

In [166]:
df.shape

(25, 4)

In [167]:
df = pd.DataFrame(np.arange(6).reshape((3, 2)))
df

   0  1
0  0  1
1  2  3
2  4  5

In [0]:
df.index = ['01', '02', '03']
df.columns = ['A', 'B']

In [169]:
df

    A  B
01  0  1
02  2  3
03  4  5

In [0]:
named_df = pd.DataFrame(np.arange(6).reshape((3, 2)),
                        columns=['A列', 'B列'],
                        index=['1行目', '2行目', '3行目'])

In [171]:
named_df

     A列  B列
1行目   0   1
2行目   2   3
3行目   4   5

In [172]:
pd.DataFrame({'A列':[0, 2, 4], 'B列':[1, 3, 5]})

   A列  B列
0   0   1
1   2   3
2   4   5

In [173]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.arange(12).reshape((4, 3)),
        columns=['A', 'B', 'C'],
        index=['1行目', '2行目', '3行目', '4行目'])
df

     A   B   C
1行目  0   1   2
2行目  3   4   5
3行目  6   7   8
4行目  9  10  11

In [174]:
df['A']

1行目    0
2行目    3
3行目    6
4行目    9
Name: A, dtype: int64

In [175]:
df[['A', 'B']]

     A   B
1行目  0   1
2行目  3   4
3行目  6   7
4行目  9  10

In [176]:
df[:2]

     A  B  C
1行目  0  1  2
2行目  3  4  5

In [177]:
df.loc[:, :]

     A   B   C
1行目  0   1   2
2行目  3   4   5
3行目  6   7   8
4行目  9  10  11

In [178]:
df.loc[:, 'A']

1行目    0
2行目    3
3行目    6
4行目    9
Name: A, dtype: int64

In [179]:
df.loc[:, ['A', 'B']]

     A   B
1行目  0   1
2行目  3   4
3行目  6   7
4行目  9  10

In [180]:
df.loc['1行目', :]

A    0
B    1
C    2
Name: 1行目, dtype: int64

In [181]:
df.loc[['1行目', '3行目'], :]

     A  B  C
1行目  0  1  2
3行目  6  7  8

In [182]:
df.loc[['1行目'],['A', 'C']]

     A  C
1行目  0  2

In [183]:
df.iloc[1, 1]

4

In [184]:
df.iloc[1:, 1]

2行目     4
3行目     7
4行目    10
Name: B, dtype: int64

In [185]:
df.iloc[1:, :2]

     A   B
2行目  3   4
3行目  6   7
4行目  9  10

4.2.2 **データの読み込み・書き込み**

In [186]:
# show upload dialog
from google.colab import files
uploaded = files.upload()

In [187]:
import pandas as pd
df = pd.read_csv('/content/201704health.csv', encoding='utf-8')
df

            日付     歩数  摂取カロリー
0   2017-04-01   5439    2500
1   2017-04-02   2510    2300
2   2017-04-03  10238    1950
3   2017-04-04   8209    1850
4   2017-04-05   9434    1930
5   2017-04-06   7593    1800
6   2017-04-07   9320    1940
7   2017-04-08   4873    2300
8   2017-04-09  12045    1950
9   2017-04-10   7493    1850
10  2017-04-11   7289    1930
11  2017-04-12   6481    2300
12  2017-04-13  10287    1800
13  2017-04-14   8043    1940
14  2017-04-15   7435    2300
15  2017-04-16   7529    2300
16  2017-04-17   8031    1940
17  2017-04-18   8475    2300
18  2017-04-19   8132    1950
19  2017-04-20  15328    1800
20  2017-04-21  12849    1940
21  2017-04-22   4029    2300
22  2017-04-23   3890    1950
23  2017-04-24   8093    1850
24  2017-04-25   7823    1950
25  2017-04-26   7492    1850
26  2017-04-27   7203    1930
27  2017-04-28   7302    1850
28  2017-04-29   6033    2300
29  2017-04-30   4093    1950

In [188]:
import pandas as pd
df = pd.read_excel('/content/201704health.xlsx')
df

            日付     歩数  摂取カロリー
0   2017-04-01   5439    2500
1   2017-04-02   2510    2300
2   2017-04-03  10238    1950
3   2017-04-04   8209    1850
4   2017-04-05   9434    1930
5   2017-04-06   7593    1800
6   2017-04-07   9320    1940
7   2017-04-08   4873    2300
8   2017-04-09  12045    1950
9   2017-04-10   7493    1850
10  2017-04-11   7289    1930
11  2017-04-12   6481    2300
12  2017-04-13  10287    1800
13  2017-04-14   8043    1940
14  2017-04-15   7435    2300
15  2017-04-16   7529    2300
16  2017-04-17   8031    1940
17  2017-04-18   8475    2300
18  2017-04-19   8132    1950
19  2017-04-20  15328    1800
20  2017-04-21  12849    1940
21  2017-04-22   4029    2300
22  2017-04-23   3890    1950
23  2017-04-24   8093    1850
24  2017-04-25   7823    1950
25  2017-04-26   7492    1850
26  2017-04-27   7203    1930
27  2017-04-28   7302    1850
28  2017-04-29   6033    2300
29  2017-04-30   4093    1950

In [0]:
url = 'https://ja.wikipedia.org/wiki/%E3%83%88%E3%83%83%E3%83%97%E3%83%AC%E3%83%99%E3%83%AB%E3%83%89%E3%83%A1%E3%82%A4%E3%83%B3%E4%B8%80%E8%A6%A7'
tables = pd.read_html(url)

In [190]:
len(tables)

43

In [191]:
df = tables[4]
df

    Name        Entity          Explanation  ... DNSSEC            SLD IPv6
0    .ac       アセンション島                  NaN  ...    Yes            Yes  Yes
1    .ad          アンドラ                  NaN  ...    Yes            Yes  NaN
2    .ae      アラブ首長国連邦                  NaN  ...     No            Yes  NaN
3    .af       アフガニスタン                  NaN  ...    Yes            Yes  NaN
4    .ag  アンティグア・バーブーダ                  NaN  ...    Yes            Yes  NaN
..   ...           ...                  ...  ...    ...            ...  ...
248  .ye          イエメン                  NaN  ...     No             No  NaN
249  .yt         マヨット島                  NaN  ...    Yes            Yes  NaN
250  .za         南アフリカ  Zuid-Afrika (オランダ語)  ...     No             No  NaN
251  .zm          ザンビア                  NaN  ...    Yes  Yes[cctld 28]  NaN
252  .zw         ジンバブエ                  NaN  ...     No             No  NaN

[253 rows x 8 columns]

In [0]:
df.to_csv('/content/write_data.csv')

In [0]:
df.to_excel('/content/write_data.xlsx')

In [0]:
df.to_pickle('/content/write_df.pickle')

In [0]:
df = pd.read_pickle('/content/write_df.pickle')

In [196]:
df

    Name        Entity          Explanation  ... DNSSEC            SLD IPv6
0    .ac       アセンション島                  NaN  ...    Yes            Yes  Yes
1    .ad          アンドラ                  NaN  ...    Yes            Yes  NaN
2    .ae      アラブ首長国連邦                  NaN  ...     No            Yes  NaN
3    .af       アフガニスタン                  NaN  ...    Yes            Yes  NaN
4    .ag  アンティグア・バーブーダ                  NaN  ...    Yes            Yes  NaN
..   ...           ...                  ...  ...    ...            ...  ...
248  .ye          イエメン                  NaN  ...     No             No  NaN
249  .yt         マヨット島                  NaN  ...    Yes            Yes  NaN
250  .za         南アフリカ  Zuid-Afrika (オランダ語)  ...     No             No  NaN
251  .zm          ザンビア                  NaN  ...    Yes  Yes[cctld 28]  NaN
252  .zw         ジンバブエ                  NaN  ...     No             No  NaN

[253 rows x 8 columns]

**4.2.3 データの成型**

In [0]:
import pandas as pd
import numpy as np

In [198]:
df = pd.read_excel('/content/201704health.xlsx')
df

            日付     歩数  摂取カロリー
0   2017-04-01   5439    2500
1   2017-04-02   2510    2300
2   2017-04-03  10238    1950
3   2017-04-04   8209    1850
4   2017-04-05   9434    1930
5   2017-04-06   7593    1800
6   2017-04-07   9320    1940
7   2017-04-08   4873    2300
8   2017-04-09  12045    1950
9   2017-04-10   7493    1850
10  2017-04-11   7289    1930
11  2017-04-12   6481    2300
12  2017-04-13  10287    1800
13  2017-04-14   8043    1940
14  2017-04-15   7435    2300
15  2017-04-16   7529    2300
16  2017-04-17   8031    1940
17  2017-04-18   8475    2300
18  2017-04-19   8132    1950
19  2017-04-20  15328    1800
20  2017-04-21  12849    1940
21  2017-04-22   4029    2300
22  2017-04-23   3890    1950
23  2017-04-24   8093    1850
24  2017-04-25   7823    1950
25  2017-04-26   7492    1850
26  2017-04-27   7203    1930
27  2017-04-28   7302    1850
28  2017-04-29   6033    2300
29  2017-04-30   4093    1950

In [199]:
df['歩数'] >= 10000

0     False
1     False
2      True
3     False
4     False
5     False
6     False
7     False
8      True
9     False
10    False
11    False
12     True
13    False
14    False
15    False
16    False
17    False
18    False
19     True
20     True
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
Name: 歩数, dtype: bool

In [200]:
df_selected = df[df['歩数'] >= 10000]
df_selected

            日付     歩数  摂取カロリー
2   2017-04-03  10238    1950
8   2017-04-09  12045    1950
12  2017-04-13  10287    1800
19  2017-04-20  15328    1800
20  2017-04-21  12849    1940

In [201]:
df_selected.shape

(5, 3)

In [202]:
df.query('歩数 >=10000 and 摂取カロリー <= 1800')

            日付     歩数  摂取カロリー
12  2017-04-13  10287    1800
19  2017-04-20  15328    1800

In [203]:
df.query('歩数 >= 10000')

            日付     歩数  摂取カロリー
2   2017-04-03  10238    1950
8   2017-04-09  12045    1950
12  2017-04-13  10287    1800
19  2017-04-20  15328    1800
20  2017-04-21  12849    1940

In [204]:
df.dtypes

日付        object
歩数         int64
摂取カロリー     int64
dtype: object

In [0]:
df.loc[:, 'date'] = df.loc[:, '日付'].apply(pd.to_datetime)

In [206]:
df.loc[:, 'date']

0    2017-04-01
1    2017-04-02
2    2017-04-03
3    2017-04-04
4    2017-04-05
5    2017-04-06
6    2017-04-07
7    2017-04-08
8    2017-04-09
9    2017-04-10
10   2017-04-11
11   2017-04-12
12   2017-04-13
13   2017-04-14
14   2017-04-15
15   2017-04-16
16   2017-04-17
17   2017-04-18
18   2017-04-19
19   2017-04-20
20   2017-04-21
21   2017-04-22
22   2017-04-23
23   2017-04-24
24   2017-04-25
25   2017-04-26
26   2017-04-27
27   2017-04-28
28   2017-04-29
29   2017-04-30
Name: date, dtype: datetime64[ns]

In [207]:
df

            日付     歩数  摂取カロリー       date
0   2017-04-01   5439    2500 2017-04-01
1   2017-04-02   2510    2300 2017-04-02
2   2017-04-03  10238    1950 2017-04-03
3   2017-04-04   8209    1850 2017-04-04
4   2017-04-05   9434    1930 2017-04-05
5   2017-04-06   7593    1800 2017-04-06
6   2017-04-07   9320    1940 2017-04-07
7   2017-04-08   4873    2300 2017-04-08
8   2017-04-09  12045    1950 2017-04-09
9   2017-04-10   7493    1850 2017-04-10
10  2017-04-11   7289    1930 2017-04-11
11  2017-04-12   6481    2300 2017-04-12
12  2017-04-13  10287    1800 2017-04-13
13  2017-04-14   8043    1940 2017-04-14
14  2017-04-15   7435    2300 2017-04-15
15  2017-04-16   7529    2300 2017-04-16
16  2017-04-17   8031    1940 2017-04-17
17  2017-04-18   8475    2300 2017-04-18
18  2017-04-19   8132    1950 2017-04-19
19  2017-04-20  15328    1800 2017-04-20
20  2017-04-21  12849    1940 2017-04-21
21  2017-04-22   4029    2300 2017-04-22
22  2017-04-23   3890    1950 2017-04-23
23  2017-04-24   8093    1850 2017-04-24
24  2017-04-25   7823    1950 2017-04-25
25  2017-04-26   7492    1850 2017-04-26
26  2017-04-27   7203    1930 2017-04-27
27  2017-04-28   7302    1850 2017-04-28
28  2017-04-29   6033    2300 2017-04-29
29  2017-04-30   4093    1950 2017-04-30

In [0]:
df.loc[:, '摂取カロリー'] = df.loc[:, '摂取カロリー'].astype(np.float32)

In [0]:
df = df.set_index('date')

In [210]:
df.head()

                    日付     歩数  摂取カロリー
date
2017-04-01  2017-04-01   5439  2500.0
2017-04-02  2017-04-02   2510  2300.0
2017-04-03  2017-04-03  10238  1950.0
2017-04-04  2017-04-04   8209  1850.0
2017-04-05  2017-04-05   9434  1930.0

In [211]:
df.sort_values(by='歩数')

                    日付     歩数  摂取カロリー
date
2017-04-02  2017-04-02   2510  2300.0
2017-04-23  2017-04-23   3890  1950.0
2017-04-22  2017-04-22   4029  2300.0
2017-04-30  2017-04-30   4093  1950.0
2017-04-08  2017-04-08   4873  2300.0
2017-04-01  2017-04-01   5439  2500.0
2017-04-29  2017-04-29   6033  2300.0
2017-04-12  2017-04-12   6481  2300.0
2017-04-27  2017-04-27   7203  1930.0
2017-04-11  2017-04-11   7289  1930.0
2017-04-28  2017-04-28   7302  1850.0
2017-04-15  2017-04-15   7435  2300.0
2017-04-26  2017-04-26   7492  1850.0
2017-04-10  2017-04-10   7493  1850.0
2017-04-16  2017-04-16   7529  2300.0
2017-04-06  2017-04-06   7593  1800.0
2017-04-25  2017-04-25   7823  1950.0
2017-04-17  2017-04-17   8031  1940.0
2017-04-14  2017-04-14   8043  1940.0
2017-04-24  2017-04-24   8093  1850.0
2017-04-19  2017-04-19   8132  1950.0
2017-04-04  2017-04-04   8209  1850.0
2017-04-18  2017-04-18   8475  2300.0
2017-04-07  2017-04-07   9320  1940.0
2017-04-05  2017-04-05   9434  1930.0
2017-04-03  2017-04-03  10238  1950.0
2017-04-13  2017-04-13  10287  1800.0
2017-04-09  2017-04-09  12045  1950.0
2017-04-21  2017-04-21  12849  1940.0
2017-04-20  2017-04-20  15328  1800.0

In [212]:
df.sort_values(by='歩数', ascending=False).head()

                    日付     歩数  摂取カロリー
date
2017-04-20  2017-04-20  15328  1800.0
2017-04-21  2017-04-21  12849  1940.0
2017-04-09  2017-04-09  12045  1950.0
2017-04-13  2017-04-13  10287  1800.0
2017-04-03  2017-04-03  10238  1950.0

In [0]:
df = df.drop('日付', axis=1)

In [214]:
df

               歩数  摂取カロリー
date
2017-04-01   5439  2500.0
2017-04-02   2510  2300.0
2017-04-03  10238  1950.0
2017-04-04   8209  1850.0
2017-04-05   9434  1930.0
2017-04-06   7593  1800.0
2017-04-07   9320  1940.0
2017-04-08   4873  2300.0
2017-04-09  12045  1950.0
2017-04-10   7493  1850.0
2017-04-11   7289  1930.0
2017-04-12   6481  2300.0
2017-04-13  10287  1800.0
2017-04-14   8043  1940.0
2017-04-15   7435  2300.0
2017-04-16   7529  2300.0
2017-04-17   8031  1940.0
2017-04-18   8475  2300.0
2017-04-19   8132  1950.0
2017-04-20  15328  1800.0
2017-04-21  12849  1940.0
2017-04-22   4029  2300.0
2017-04-23   3890  1950.0
2017-04-24   8093  1850.0
2017-04-25   7823  1950.0
2017-04-26   7492  1850.0
2017-04-27   7203  1930.0
2017-04-28   7302  1850.0
2017-04-29   6033  2300.0
2017-04-30   4093  1950.0

In [215]:
df.tail()

              歩数  摂取カロリー
date
2017-04-26  7492  1850.0
2017-04-27  7203  1930.0
2017-04-28  7302  1850.0
2017-04-29  6033  2300.0
2017-04-30  4093  1950.0

In [216]:
df.loc[:, '歩数/カロリー'] = df.loc[:, '歩数'] / df.loc[:, '摂取カロリー']
df

               歩数  摂取カロリー   歩数/カロリー
date
2017-04-01   5439  2500.0  2.175600
2017-04-02   2510  2300.0  1.091304
2017-04-03  10238  1950.0  5.250256
2017-04-04   8209  1850.0  4.437297
2017-04-05   9434  1930.0  4.888083
2017-04-06   7593  1800.0  4.218333
2017-04-07   9320  1940.0  4.804124
2017-04-08   4873  2300.0  2.118696
2017-04-09  12045  1950.0  6.176923
2017-04-10   7493  1850.0  4.050270
2017-04-11   7289  1930.0  3.776684
2017-04-12   6481  2300.0  2.817826
2017-04-13  10287  1800.0  5.715000
2017-04-14   8043  1940.0  4.145876
2017-04-15   7435  2300.0  3.232609
2017-04-16   7529  2300.0  3.273478
2017-04-17   8031  1940.0  4.139691
2017-04-18   8475  2300.0  3.684783
2017-04-19   8132  1950.0  4.170256
2017-04-20  15328  1800.0  8.515556
2017-04-21  12849  1940.0  6.623196
2017-04-22   4029  2300.0  1.751739
2017-04-23   3890  1950.0  1.994872
2017-04-24   8093  1850.0  4.374595
2017-04-25   7823  1950.0  4.011795
2017-04-26   7492  1850.0  4.049730
2017-04-27   7203  1930.0  3.732124
2017-04-28   7302  1850.0  3.947027
2017-04-29   6033  2300.0  2.623043
2017-04-30   4093  1950.0  2.098974

In [0]:
def excercise_judge(ex):
  if ex <= 3.0:
    return 'Low'
  elif 3.0 < ex <= 6.0:
    return 'Mid'
  else:
    return 'High'

In [218]:
df.loc[:, '運動指数'] = df.loc[:, '歩数/カロリー'].apply(excercise_judge)
df

               歩数  摂取カロリー   歩数/カロリー  運動指数
date
2017-04-01   5439  2500.0  2.175600   Low
2017-04-02   2510  2300.0  1.091304   Low
2017-04-03  10238  1950.0  5.250256   Mid
2017-04-04   8209  1850.0  4.437297   Mid
2017-04-05   9434  1930.0  4.888083   Mid
2017-04-06   7593  1800.0  4.218333   Mid
2017-04-07   9320  1940.0  4.804124   Mid
2017-04-08   4873  2300.0  2.118696   Low
2017-04-09  12045  1950.0  6.176923  High
2017-04-10   7493  1850.0  4.050270   Mid
2017-04-11   7289  1930.0  3.776684   Mid
2017-04-12   6481  2300.0  2.817826   Low
2017-04-13  10287  1800.0  5.715000   Mid
2017-04-14   8043  1940.0  4.145876   Mid
2017-04-15   7435  2300.0  3.232609   Mid
2017-04-16   7529  2300.0  3.273478   Mid
2017-04-17   8031  1940.0  4.139691   Mid
2017-04-18   8475  2300.0  3.684783   Mid
2017-04-19   8132  1950.0  4.170256   Mid
2017-04-20  15328  1800.0  8.515556  High
2017-04-21  12849  1940.0  6.623196  High
2017-04-22   4029  2300.0  1.751739   Low
2017-04-23   3890  1950.0  1.994872   Low
2017-04-24   8093  1850.0  4.374595   Mid
2017-04-25   7823  1950.0  4.011795   Mid
2017-04-26   7492  1850.0  4.049730   Mid
2017-04-27   7203  1930.0  3.732124   Mid
2017-04-28   7302  1850.0  3.947027   Mid
2017-04-29   6033  2300.0  2.623043   Low
2017-04-30   4093  1950.0  2.098974   Low

In [0]:
df.to_pickle('/content/df_.201704health.pickle')

df_moved = pd.get_dummies(df.loc[:, '運動指数'], prefix='運動')
df_moved

In [0]:
df_moved.to_pickle('/content/df_.201704moved.pickle')

4.2.4 **時系列データ**

In [221]:
dates = pd.date_range(start='2017-04-01', end='2017-04-30')
dates

DatetimeIndex(['2017-04-01', '2017-04-02', '2017-04-03', '2017-04-04',
               '2017-04-05', '2017-04-06', '2017-04-07', '2017-04-08',
               '2017-04-09', '2017-04-10', '2017-04-11', '2017-04-12',
               '2017-04-13', '2017-04-14', '2017-04-15', '2017-04-16',
               '2017-04-17', '2017-04-18', '2017-04-19', '2017-04-20',
               '2017-04-21', '2017-04-22', '2017-04-23', '2017-04-24',
               '2017-04-25', '2017-04-26', '2017-04-27', '2017-04-28',
               '2017-04-29', '2017-04-30'],
              dtype='datetime64[ns]', freq='D')

In [222]:
np.random.seed(123)
df = pd.DataFrame(np.random.randint(1, 31, 30), index=dates, columns=['乱数'])
df

            乱数
2017-04-01  14
2017-04-02   3
2017-04-03  29
2017-04-04   3
2017-04-05   7
2017-04-06  18
2017-04-07  20
2017-04-08  11
2017-04-09  28
2017-04-10  26
2017-04-11  23
2017-04-12   2
2017-04-13   1
2017-04-14  18
2017-04-15  16
2017-04-16  10
2017-04-17   1
2017-04-18  15
2017-04-19   1
2017-04-20  16
2017-04-21  26
2017-04-22  20
2017-04-23  15
2017-04-24  30
2017-04-25   5
2017-04-26   1
2017-04-27  17
2017-04-28   5
2017-04-29  18
2017-04-30  24

In [223]:
dates = pd.date_range(start='2017-01-01', periods=365)
dates

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10',
               ...
               '2017-12-22', '2017-12-23', '2017-12-24', '2017-12-25',
               '2017-12-26', '2017-12-27', '2017-12-28', '2017-12-29',
               '2017-12-30', '2017-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [224]:
np.random.seed(123)
df = pd.DataFrame(np.random.randint(1, 31, 365), index=dates, columns=['乱数'])
df

            乱数
2017-01-01  14
2017-01-02   3
2017-01-03  29
2017-01-04   3
2017-01-05   7
...         ..
2017-12-27  22
2017-12-28   5
2017-12-29  22
2017-12-30   1
2017-12-31   8

[365 rows x 1 columns]

In [225]:
df.groupby(pd.Grouper(freq='M')).mean()

                   乱数
2017-01-31  13.774194
2017-02-28  13.428571
2017-03-31  15.612903
2017-04-30  15.533333
2017-05-31  15.322581
2017-06-30  14.300000
2017-07-31  15.258065
2017-08-31  16.129032
2017-09-30  18.433333
2017-10-31  14.580645
2017-11-30  12.633333
2017-12-31  17.483871

In [226]:
df.loc[:, '乱数'].resample('M').mean()

2017-01-31    13.774194
2017-02-28    13.428571
2017-03-31    15.612903
2017-04-30    15.533333
2017-05-31    15.322581
2017-06-30    14.300000
2017-07-31    15.258065
2017-08-31    16.129032
2017-09-30    18.433333
2017-10-31    14.580645
2017-11-30    12.633333
2017-12-31    17.483871
Freq: M, Name: 乱数, dtype: float64

In [227]:
pd.date_range(start='2017-01-01', end='2017-12-31', freq='W-SAT')

DatetimeIndex(['2017-01-07', '2017-01-14', '2017-01-21', '2017-01-28',
               '2017-02-04', '2017-02-11', '2017-02-18', '2017-02-25',
               '2017-03-04', '2017-03-11', '2017-03-18', '2017-03-25',
               '2017-04-01', '2017-04-08', '2017-04-15', '2017-04-22',
               '2017-04-29', '2017-05-06', '2017-05-13', '2017-05-20',
               '2017-05-27', '2017-06-03', '2017-06-10', '2017-06-17',
               '2017-06-24', '2017-07-01', '2017-07-08', '2017-07-15',
               '2017-07-22', '2017-07-29', '2017-08-05', '2017-08-12',
               '2017-08-19', '2017-08-26', '2017-09-02', '2017-09-09',
               '2017-09-16', '2017-09-23', '2017-09-30', '2017-10-07',
               '2017-10-14', '2017-10-21', '2017-10-28', '2017-11-04',
               '2017-11-11', '2017-11-18', '2017-11-25', '2017-12-02',
               '2017-12-09', '2017-12-16', '2017-12-23', '2017-12-30'],
              dtype='datetime64[ns]', freq='W-SAT')

In [228]:
df_year = pd.DataFrame(df.groupby(pd.Grouper(freq='W-SAT')).sum(), columns=['乱数'])
df_year

             乱数
2017-01-07   94
2017-01-14  109
2017-01-21   85
2017-01-28   93
2017-02-04   81
2017-02-11  127
2017-02-18  114
2017-02-25   82
2017-03-04   71
2017-03-11  117
2017-03-18  132
2017-03-25  103
2017-04-01  105
2017-04-08  133
2017-04-15  109
2017-04-22  111
2017-04-29   67
2017-05-06  108
2017-05-13  124
2017-05-20  103
2017-05-27   78
2017-06-03  131
2017-06-10   80
2017-06-17  110
2017-06-24   84
2017-07-01  123
2017-07-08  136
2017-07-15   68
2017-07-22  107
2017-07-29  111
2017-08-05  104
2017-08-12  109
2017-08-19   87
2017-08-26  137
2017-09-02  120
2017-09-09  150
2017-09-16  120
2017-09-23  163
2017-09-30   97
2017-10-07   72
2017-10-14   97
2017-10-21  107
2017-10-28  134
2017-11-04   77
2017-11-11   51
2017-11-18   90
2017-11-25  132
2017-12-02   97
2017-12-09  137
2017-12-16  139
2017-12-23  127
2017-12-30  105
2018-01-06    8

4.2.5 **欠損地処理**

In [229]:
import pandas as pd
df_201705 = pd.read_csv('/content/201705health.csv', encoding='utf-8',index_col='日付', parse_dates=True)
df_201705

                歩数  摂取カロリー
日付
2017-05-01  1439.0  4500.0
2017-05-02  8120.0  2420.0
2017-05-03     NaN     NaN
2017-05-04  2329.0  1500.0
2017-05-05     NaN     NaN
2017-05-06  3233.0  1800.0
2017-05-07  9593.0  2200.0
2017-05-08  9213.0  1800.0
2017-05-09  5593.0  2500.0

In [0]:
df_201705_drop = df_201705.dropna()

In [231]:
df_201705_drop

                歩数  摂取カロリー
日付
2017-05-01  1439.0  4500.0
2017-05-02  8120.0  2420.0
2017-05-04  2329.0  1500.0
2017-05-06  3233.0  1800.0
2017-05-07  9593.0  2200.0
2017-05-08  9213.0  1800.0
2017-05-09  5593.0  2500.0

In [232]:
df_201705_fillna = df_201705.fillna(0)
df_201705_fillna

                歩数  摂取カロリー
日付
2017-05-01  1439.0  4500.0
2017-05-02  8120.0  2420.0
2017-05-03     0.0     0.0
2017-05-04  2329.0  1500.0
2017-05-05     0.0     0.0
2017-05-06  3233.0  1800.0
2017-05-07  9593.0  2200.0
2017-05-08  9213.0  1800.0
2017-05-09  5593.0  2500.0

In [234]:
df_201705_fill = df_201705.fillna(method='ffill')
df_201705_fill

                歩数  摂取カロリー
日付
2017-05-01  1439.0  4500.0
2017-05-02  8120.0  2420.0
2017-05-03  8120.0  2420.0
2017-05-04  2329.0  1500.0
2017-05-05  2329.0  1500.0
2017-05-06  3233.0  1800.0
2017-05-07  9593.0  2200.0
2017-05-08  9213.0  1800.0
2017-05-09  5593.0  2500.0

In [235]:
df_201705_fillmean = df_201705.fillna(df_201705.mean())
df_201705_fillmean

                     歩数       摂取カロリー
日付
2017-05-01  1439.000000  4500.000000
2017-05-02  8120.000000  2420.000000
2017-05-03  5645.714286  2388.571429
2017-05-04  2329.000000  1500.000000
2017-05-05  5645.714286  2388.571429
2017-05-06  3233.000000  1800.000000
2017-05-07  9593.000000  2200.000000
2017-05-08  9213.000000  1800.000000
2017-05-09  5593.000000  2500.000000

4.2.6 **データ連結**

In [236]:
df = pd.read_pickle('/content/df_.201704health.pickle')
df

               歩数  摂取カロリー   歩数/カロリー  運動指数
date
2017-04-01   5439  2500.0  2.175600   Low
2017-04-02   2510  2300.0  1.091304   Low
2017-04-03  10238  1950.0  5.250256   Mid
2017-04-04   8209  1850.0  4.437297   Mid
2017-04-05   9434  1930.0  4.888083   Mid
2017-04-06   7593  1800.0  4.218333   Mid
2017-04-07   9320  1940.0  4.804124   Mid
2017-04-08   4873  2300.0  2.118696   Low
2017-04-09  12045  1950.0  6.176923  High
2017-04-10   7493  1850.0  4.050270   Mid
2017-04-11   7289  1930.0  3.776684   Mid
2017-04-12   6481  2300.0  2.817826   Low
2017-04-13  10287  1800.0  5.715000   Mid
2017-04-14   8043  1940.0  4.145876   Mid
2017-04-15   7435  2300.0  3.232609   Mid
2017-04-16   7529  2300.0  3.273478   Mid
2017-04-17   8031  1940.0  4.139691   Mid
2017-04-18   8475  2300.0  3.684783   Mid
2017-04-19   8132  1950.0  4.170256   Mid
2017-04-20  15328  1800.0  8.515556  High
2017-04-21  12849  1940.0  6.623196  High
2017-04-22   4029  2300.0  1.751739   Low
2017-04-23   3890  1950.0  1.994872   Low
2017-04-24   8093  1850.0  4.374595   Mid
2017-04-25   7823  1950.0  4.011795   Mid
2017-04-26   7492  1850.0  4.049730   Mid
2017-04-27   7203  1930.0  3.732124   Mid
2017-04-28   7302  1850.0  3.947027   Mid
2017-04-29   6033  2300.0  2.623043   Low
2017-04-30   4093  1950.0  2.098974   Low

In [237]:
df_moved = pd.read_pickle('/content/df_.201704moved.pickle')
df_moved

            運動_High  運動_Low  運動_Mid
date
2017-04-01        0       1       0
2017-04-02        0       1       0
2017-04-03        0       0       1
2017-04-04        0       0       1
2017-04-05        0       0       1
2017-04-06        0       0       1
2017-04-07        0       0       1
2017-04-08        0       1       0
2017-04-09        1       0       0
2017-04-10        0       0       1
2017-04-11        0       0       1
2017-04-12        0       1       0
2017-04-13        0       0       1
2017-04-14        0       0       1
2017-04-15        0       0       1
2017-04-16        0       0       1
2017-04-17        0       0       1
2017-04-18        0       0       1
2017-04-19        0       0       1
2017-04-20        1       0       0
2017-04-21        1       0       0
2017-04-22        0       1       0
2017-04-23        0       1       0
2017-04-24        0       0       1
2017-04-25        0       0       1
2017-04-26        0       0       1
2017-04-27        0       0       1
2017-04-28        0       0       1
2017-04-29        0       1       0
2017-04-30        0       1       0

In [238]:
df_merged = pd.concat([df, df_moved], axis=1)
df_merged

               歩数  摂取カロリー   歩数/カロリー  運動指数  運動_High  運動_Low  運動_Mid
date
2017-04-01   5439  2500.0  2.175600   Low        0       1       0
2017-04-02   2510  2300.0  1.091304   Low        0       1       0
2017-04-03  10238  1950.0  5.250256   Mid        0       0       1
2017-04-04   8209  1850.0  4.437297   Mid        0       0       1
2017-04-05   9434  1930.0  4.888083   Mid        0       0       1
2017-04-06   7593  1800.0  4.218333   Mid        0       0       1
2017-04-07   9320  1940.0  4.804124   Mid        0       0       1
2017-04-08   4873  2300.0  2.118696   Low        0       1       0
2017-04-09  12045  1950.0  6.176923  High        1       0       0
2017-04-10   7493  1850.0  4.050270   Mid        0       0       1
2017-04-11   7289  1930.0  3.776684   Mid        0       0       1
2017-04-12   6481  2300.0  2.817826   Low        0       1       0
2017-04-13  10287  1800.0  5.715000   Mid        0       0       1
2017-04-14   8043  1940.0  4.145876   Mid        0       0       1
2017-04-15   7435  2300.0  3.232609   Mid        0       0       1
2017-04-16   7529  2300.0  3.273478   Mid        0       0       1
2017-04-17   8031  1940.0  4.139691   Mid        0       0       1
2017-04-18   8475  2300.0  3.684783   Mid        0       0       1
2017-04-19   8132  1950.0  4.170256   Mid        0       0       1
2017-04-20  15328  1800.0  8.515556  High        1       0       0
2017-04-21  12849  1940.0  6.623196  High        1       0       0
2017-04-22   4029  2300.0  1.751739   Low        0       1       0
2017-04-23   3890  1950.0  1.994872   Low        0       1       0
2017-04-24   8093  1850.0  4.374595   Mid        0       0       1
2017-04-25   7823  1950.0  4.011795   Mid        0       0       1
2017-04-26   7492  1850.0  4.049730   Mid        0       0       1
2017-04-27   7203  1930.0  3.732124   Mid        0       0       1
2017-04-28   7302  1850.0  3.947027   Mid        0       0       1
2017-04-29   6033  2300.0  2.623043   Low        0       1       0
2017-04-30   4093  1950.0  2.098974   Low        0       1       0

In [239]:
df_merged_0405 = pd.concat([df_merged, df_201705_fill], axis=0, sort=True)
df_merged_0405

            摂取カロリー       歩数   歩数/カロリー  運動_High  運動_Low  運動_Mid  運動指数
2017-04-01  2500.0   5439.0  2.175600      0.0     1.0     0.0   Low
2017-04-02  2300.0   2510.0  1.091304      0.0     1.0     0.0   Low
2017-04-03  1950.0  10238.0  5.250256      0.0     0.0     1.0   Mid
2017-04-04  1850.0   8209.0  4.437297      0.0     0.0     1.0   Mid
2017-04-05  1930.0   9434.0  4.888083      0.0     0.0     1.0   Mid
2017-04-06  1800.0   7593.0  4.218333      0.0     0.0     1.0   Mid
2017-04-07  1940.0   9320.0  4.804124      0.0     0.0     1.0   Mid
2017-04-08  2300.0   4873.0  2.118696      0.0     1.0     0.0   Low
2017-04-09  1950.0  12045.0  6.176923      1.0     0.0     0.0  High
2017-04-10  1850.0   7493.0  4.050270      0.0     0.0     1.0   Mid
2017-04-11  1930.0   7289.0  3.776684      0.0     0.0     1.0   Mid
2017-04-12  2300.0   6481.0  2.817826      0.0     1.0     0.0   Low
2017-04-13  1800.0  10287.0  5.715000      0.0     0.0     1.0   Mid
2017-04-14  1940.0   8043.0  4.145876      0.0     0.0     1.0   Mid
2017-04-15  2300.0   7435.0  3.232609      0.0     0.0     1.0   Mid
2017-04-16  2300.0   7529.0  3.273478      0.0     0.0     1.0   Mid
2017-04-17  1940.0   8031.0  4.139691      0.0     0.0     1.0   Mid
2017-04-18  2300.0   8475.0  3.684783      0.0     0.0     1.0   Mid
2017-04-19  1950.0   8132.0  4.170256      0.0     0.0     1.0   Mid
2017-04-20  1800.0  15328.0  8.515556      1.0     0.0     0.0  High
2017-04-21  1940.0  12849.0  6.623196      1.0     0.0     0.0  High
2017-04-22  2300.0   4029.0  1.751739      0.0     1.0     0.0   Low
2017-04-23  1950.0   3890.0  1.994872      0.0     1.0     0.0   Low
2017-04-24  1850.0   8093.0  4.374595      0.0     0.0     1.0   Mid
2017-04-25  1950.0   7823.0  4.011795      0.0     0.0     1.0   Mid
2017-04-26  1850.0   7492.0  4.049730      0.0     0.0     1.0   Mid
2017-04-27  1930.0   7203.0  3.732124      0.0     0.0     1.0   Mid
2017-04-28  1850.0   7302.0  3.947027      0.0     0.0     1.0   Mid
2017-04-29  2300.0   6033.0  2.623043      0.0     1.0     0.0   Low
2017-04-30  1950.0   4093.0  2.098974      0.0     1.0     0.0   Low
2017-05-01  4500.0   1439.0       NaN      NaN     NaN     NaN   NaN
2017-05-02  2420.0   8120.0       NaN      NaN     NaN     NaN   NaN
2017-05-03  2420.0   8120.0       NaN      NaN     NaN     NaN   NaN
2017-05-04  1500.0   2329.0       NaN      NaN     NaN     NaN   NaN
2017-05-05  1500.0   2329.0       NaN      NaN     NaN     NaN   NaN
2017-05-06  1800.0   3233.0       NaN      NaN     NaN     NaN   NaN
2017-05-07  2200.0   9593.0       NaN      NaN     NaN     NaN   NaN
2017-05-08  1800.0   9213.0       NaN      NaN     NaN     NaN   NaN
2017-05-09  2500.0   5593.0       NaN      NaN     NaN     NaN   NaN